# IFCExtrusionData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExtrusionData Methods
IFCExtrusionData Class See Also
---
The IFCExtrusionData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddLoop | Adds a curve loop to the extrusion data. |
| ClearLoops | Clears the curve loops stored in the extrusion data. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLoops | Gets the curve loops that form the base shape of the extrusion. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValid | Determines if the extrusion data represents a valid extrusion. |
| RemoveLoopAt | Removes the loop at the specified index. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace